-- 최봉한 강사 프로필 설정
UPDATE public.profiles SET role = 'instructor', name = '최봉한' WHERE id = '4654a1cd-25c3-419d-af3f-7e8d9c1dc835';

-- 박시호 강사 배정
UPDATE public.students SET instructor_id = '865a7139-9520-4501-acaf-f83340ad1a08'
WHERE LEFT(name, 3) IN ('강동채', '강리안', '강민지', '강유안', '고태현', '공다겸', '김가람', '김다은', '김도현', '김민서', '김시아', '김아진', '김우솔', '김윤우', '김정율', '김지안', '김채언', '김하람', '노하린', '노하윤', '노하율', '문상화', '민서영', '민지윤', '민지환', '박규민', '박서준', '박소현', '박수빈', '박재윤', '박정혁', '박주원', '박지우', '박채아', '박한별', '박한빈', '박혜인', '백승민', '백승헌', '변시훈', '서유나', '오나윤', '유서준', '유해든', '윤선호', '윤찬유', '윤태경', '이산하', '이재인', '이진서', '전지윤', '전하정', '정서희', '정은우', '정하준', '정희수', '조보겸', '조연우', '조이현', '지하윤', '진현승', '최시우', '최은우', '탁진연', '하도윤', '홍리나', '황시윤', '황재원', '황지빈');

-- 김민선 강사 배정
UPDATE public.students SET instructor_id = '4f1332bf-f1b4-4dde-aabf-7deb8dc63a52'
WHERE LEFT(name, 3) IN ('강리안', '강민서', '강시훈', '구하라', '김도헌', '김레나', '김리안', '김소율', '김승유', '김시연', '김시현', '김우솔', '김윤서', '김주안', '김지안', '김태운', '김현승', '김현지', '남예준', '문영은', '박상현', '박수빈', '박은수', '박은우', '박재경', '박재영', '박지우', '박한별', '박한빈', '반하라', '서연우', '손수연', '송예찬', '여지운', '오승주', '오현수', '윤선호', '윤하윤', '윤형준', '이설', '이수영', '이재인', '이재희', '이정현', '임유정', '임지은', '장서영', '장윤재', '전수빈', '전재이', '전하정', '정수혜', '정현서', '제다연', '조서연', '조예빈', '주연우', '최시은', '최윤선', '최은서', '허성현', '홍은우', '황규진', '황루아', '황은유');

-- 최봉한 강사 배정
UPDATE public.students SET instructor_id = '4654a1cd-25c3-419d-af3f-7e8d9c1dc835'
WHERE LEFT(name, 3) IN ('권서연', '권성재', '김민규', '김소율', '박채연', '손자인', '옥승민', '이태건', '이한결', '임유리', '임지아', '임지은', '장서율', '정민준', '정우양', '정유안', '정유하', '주예린', '주예원', '주채이', '최경민', '최규민', '최도윤', '최수빈', '하윤승', '하이솔', '홍서준', '홍정우');
